[
    {
      "image": "/park picture.jpg",
      "title": "Rides to the Park",
      "shortStory": "Every evening, my mother would take me and my little sister to the park using the Delhi Metro. We held her hands tightly, giggling as the train zoomed. She never complained — only smiled, even when tired. For us, those rides were adventures. For her, they were love.",
      "longStory": "Back when we were just kids, the Delhi Metro was a wonderland, and my mother was our guide. Every evening, despite her own exhaustion, she would take my sister and me to the park. We'd climb the metro steps with tiny legs, holding tightly to her fingers. She always bought us small snacks from the station, and we sat close on the train, watching the city blur by. At the park, she'd let us play until the sun dipped low, all the while keeping a watchful eye and smiling. She never rushed us, never let her fatigue show. For us, those trips were playtime; for her, they were precious moments of giving us joy. The metro rides weren't just journeys — they were her way of giving us childhood magic.",
      "author": "Shashwat Jain"
    },
    {
      "image": "/me and mom old picture.jpg",
      "title": "Finding the Right School",
      "shortStory": "I struggled with severe social anxiety, and school felt like a battlefield. My mother visited countless schools, gently asking if they'd understand. Some turned us away, but she never gave up. She found a place where I could sit, breathe, and be myself.",
      "longStory": "School wasn't easy for me — I had deep-rooted social anxiety that made classrooms feel like cages. While others filled forms casually, my mother fought a silent war. She visited school after school, asking principals and counselors if they'd consider a child who might need a little more kindness, a little more patience. Many said no, some hesitated. But my mother never once showed frustration in front of me. Instead, she reassured me after every rejection, 'We'll find the right place, don’t worry.' Finally, she did. A school that didn’t just take me in but understood me. That was her strength — she didn't just enroll me in a school; she found me a safe space.",
      "author": "Shashwat Jain"
    },
    {
      "image": "/family photo.jpg",
      "title": "The COVID Battle",
      "shortStory": "When COVID hit our home, my mother was the only one who didn't fall sick. She cooked, cleaned, and cared for all three of us — my dad, sister, and me. For two weeks, she slept on the couch outside our rooms. She never got a break, but she gave us all the strength to recover.",
      "longStory": "When the pandemic struck our home, it didn't spare anyone — except my mother. My father, sister, and I were all down with COVID, weak and isolated in our rooms. But she, somehow untouched by the virus, became the lifeline of our flat. For two whole weeks, she cooked separate meals, sanitized everything, checked our oxygen levels, and managed medicines — all while sleeping uncomfortably on the couch in the living room. There was no nurse, no help, just her relentless care. We’d catch glimpses of her through half-open doors, masked and tired, but always steady. She didn’t complain once. While the virus tried to weaken us, her strength held the home together. In those days, she wasn’t just a mother — she was our shield.",
      "author": "Shashwat Jain"
    }
  ]
  